import numpy as np

A = np.array([[1, 2],
              [3, 4]])
v = np.array([1,2])
result = A @ v
print(result)

#基向量
e1 = np.array([1, 0])    # x 轴方向的单位向量
e2 = np.array([0, 1])    # y 轴方向的单位向量
v = np.array([3, 2])
# 等价于：v = 3 * e1 + 2 * e2
#            = 3 * [1,0] + 2 * [0,1]
#            = [3, 2]

# 六种基本变换
# 不变
I = np.array([[1, 0],
              [0, 1]])

# 第一列 = (1,0) = e₁ 原位不动
# 第二列 = (0,1) = e₂ 原位不动

# 水平拉伸
A = np.array([[2, 0],
              [0, 1]])

# 第一列 = (2,0) → e₁ 被水平拉到原来 2 倍
# 第二列 = (0,1) → e₂ 不变

# 垂直拉伸
A = np.array([[1, 0],
              [0, 2]])

# 第一列 = (1,0) → e₁ 不变
# 第二列 = (0,2) → e₂ 被垂直拉到 2 倍

# 旋转90度
theta = np.radians(90)
A = np.array([[0, -1],
              [1,  0]])
# cos90°=0, sin90°=1 代入旋转矩阵公式

# 第一列 = (0, 1)    → e₁ 从指向右变成指向上
# 第二列 = (-1, 0)   → e₂ 从指向上变成指向左

# 水平剪切
A = np.array([[1, 0.5],
              [0, 1  ]])

# 第一列 = (1, 0) → e₁ 不变
# 第二列 = (0.5, 1) → e₂ 向右倾斜！

# 复合变换
A = np.array([[2, 0.5],
              [0.3, 1.5]])

# 同时包含拉伸 + 剪切 + 旋转

